Revit 2027 API
BuiltInFailures.ElectricalFailures.NotSupportConcentricBend Property
 Conduit with Fittings do not support Concentric Bend Radius, the bend radius of the conduit fittings will be same.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotSupportConcentricBend { get; }
Public Shared ReadOnly Property NotSupportConcentricBend As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotSupportConcentricBend {
	FailureDefinitionId^ get ();
}
static member NotSupportConcentricBend : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace